[{"title":"3 Tools You'll Use Over and Over","body_content":"I don't know about you, but my kitchen has way too many gadgets.  Garlic smashers, meat tenderizers, food choppers, apple peelers, the list goes on and on.  My workshop is the same way - specialty tools for everything from drilling dowel holes to cutting dovetails.  99% of the time, whether it's in the kitchen or the workshop I reach for the simple tools.  In the kitchen, my 9 inch chef's knife does 99% of what I need to get food ready.  In the workshop, my combination square, drill and table saw can do just about everything.  \n\nI'm a fan of multi-purpose tools.\n\nOne of the unique things about Sitesfor.church is that we use multi-purpose tools.  Yes, we ask you to learn three things to update the site: airtable, markdown and image editing. (We will be providing training on all three of these things.)  But here is the thing about airtable, markdown, and image editing - none of them are garlic smasher tools - all of them of chef knife tools.  In other words - every single one of these skills is transferable and usable to other parts of your ministry.\n\n## Two promises:\n\n### 1. We will never ask you to learn anything you can't use elsewhere.\n\n### 2. We will do our best to teach you not only how to use these tools for your website, but also how to use them in other parts of your church.\n\nLet me give you a few examples:\n\n## Airtable:\n\n![enter image description here](https://i.imgur.com/jUKF88f.png)\n\nWe think [Airtable](http://airtable.com) makes a great content management system for your website.  But Airtable can do so much more.  In our church, we use Airtable to:\n\n* Keep track of our prayer requests.\n* Organize our church membership role.\n* Plan special services.\n* Plan special music.\n* Keep track of our missionaries.\n* Sign people up for church events.\n\nAnd we've only been using Airtable for about 6 months.  Its such a simple tool and so easy to use, that we are sure there are many other ways we can use it around the church.  One of the best parts about it is everything that goes into airtable can go out to a webpage or a document.  So if you setup a system for keeping track of prayer requests and you want us to make a custom prayer sheet for that automatically pulls in the latest prayer requests - we can do that. If you decide you want to start posting your special music or you want an online signup form for an event, we can set that up.  In some cases (like the signup form) you can set that up.  It really is a tool that's very useful all around a church - not just on the website.\n\nHere is a video I made months ago when I first discovered Airtable:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/pRIGbR5rJmQ\" frameborder=\"0\" allowfullscreen></iframe>\n\n## Markdown\n![enter image description here](https://i.imgur.com/Oz4dYsX.png)\n\nMarkdown is the plain text syntax that we use for writing content on Sitesfor.church.  But it can be used for much more than just website content.  All of your writing can be done in Markdown (and I would argue SHOULD be done in markdown.)  Writing in markdown offers the following benefits over using a tool like Microsoft Word:\n\n* You focus on what you are writing, not on how it looks.\n* All of your content can easily be turned into HTML (for the web), PDFs, Microsoft Word files, or even ePubs (with a built in table of contents).  \n* The file sizes are so small, you can store millions of files on a flash drive.\n* Because the writing is just plain text, you can literally edit them on anything with a screen. Your phone, your tablet, any kind of computer.  Really, if you could find a way to get a markdown file onto an Apple or Tandy from the 1980s, you could edit them on there.\n* You can even use markdown to create bulletin, handouts and slides. (I do) check out the video below:\n\n<iframe src=\"https://player.vimeo.com/video/167143303\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n<p><a href=\"https://vimeo.com/167143303\">The geekiest (and most amazing) sermon workflow you&#039;ve never seen</a> from <a href=\"https://vimeo.com/sitesforchurch\">Ryan Hayden</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n\n## Image Editing\n\n![enter image description here](https://i.imgur.com/rOt9WvA.jpg)\n\nTools like [Canva](http://canva.com) (free and web based) and [Affinity Designer](https://affinity.serif.com/en-us/) (inexpensive software for Mac and Windows) are multi-purpose tools that you'll find yourself using over and over again.  Learning these tools will help you do things like:\n\n* Create flyers for a church event.\n* Create slides for your church screens.\n* Create any other kind of graphics that you need.\n\nCheck out this video:\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/_VBuiOhnVu8\" frameborder=\"0\" allowfullscreen></iframe>\n\n\nWe've used these tools for all of these things and plan on writing articles and making videos explaining how you can do it too.\n\n---\n\nKeeping any website updated is going to require some investment in learning a new tool.  To our knowledge, we are the only people building church websites around chef-knife tools - not demanding you purchase and learn how to use a new garlic smasher.\n\n","featured_image":[{"id":"attZRjg34kwNUYR0s","url":"https://dl.airtable.com/llXmCxXaQe6B9Vd3J82D_tools.jpg","filename":"tools.jpg","size":447559,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/J2WjVKm6QCRDHq363nyH_small_tools.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/hV8dPH1TQJCcy66X3q0c_large_tools.jpg","width":512,"height":512}}}],"date":"2016-06-29T10:35:53.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"3 tools you'll use over and over","remove spaces":"3toolsyou'lluseoverandover","remove questions":"3toolsyou'lluseoverandover","remove quotes":"3toolsyoulluseoverandover","slug":"3toolsyoulluseoverandover"},{"title":"Progress Report (So close!)","body_content":"I didn't make my goal.  \n\nMy self-imposed deadline was today and today is almost over, and we haven't launched yet.  We are really close - but not quite there.  \n\nThe last two weeks have been grueling.  I've started every day around 6am and finished every day after 11pm.  And we've accomplished a lot over the last few weeks:\n\n* I've finished three themes (two church and one for pastors and evangelists.)\n* I've standardized these themes so that they are easier to update.\n* I've figured out a way to work on these themes with our site-reps in the cloud (skipping the headache of setting up a development environment.)\n* I've created scripts that allow for fast switching between the themes (again, to help our site-reps.)\n* I've figured out how to filter the data that's coming into our site for each individual page type. (This is a complicated subject so I'll leave that here.)\n* I've setup a hosting provider and a DNS provider and integrated both into our site-rep tools.\n* I've created an in-depth site-rep [documentation site](http://siterepdocs.pubstorm.site) that walks our site reps through every aspect of setting up and managing a sitesfor.church site.  \n* I've also created hours of videos going through this for them to watch and follow along.\n* I've purchased and did the initial setup on a server that is going to be building our sites when clients upload new content. (Our system is odd, and will not be running server tasks on the same server that does the hosting.  This is pretty technical and worth it's own post.)\n* I've worked on several client sites getting them ready to launch.\n\nIn other words, we've got a lot done, and we are really, really close.  And on top of all of this, I managed to write and preach two new sermons on Sunday, teach an hour and fifteen minute Sunday school class, and run about twenty miles.  I sure am feeling it today.\n\nThere are only three things we are working on and we are ready to go:\n\n* We are building a program that tests for new Airtable data periodically and then triggers your site to be rebuilt only when new content is there.  We need this so our server doesn't run constantly and publish new stuff constantly.\n* We are finishing up our signup app. This will have a place for new clients to pay and collect the information we need to get going on a project immediately.\n* We are trying to finish our third church theme.\n\n\nI think we should be able to get started at the end of next week.\nThank you so much for your patience.\nRyan Hayden","featured_image":[{"id":"attOmCalqEc1oIVhd","url":"https://dl.airtable.com/j2A4huyIRWCxilzzUXy4_code.jpg","filename":"code.jpg","size":497907,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/M86Mg9azTuKvNDnnFlb4_small_code.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/T9Zt8akiTU2OgXAcf5tt_large_code.jpg","width":512,"height":512}}}],"date":"2016-06-27T22:22:49.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"progress report (so close!)","remove spaces":"progressreport(soclose!)","remove questions":"progressreport(soclose!)","remove quotes":"progressreport(soclose!)","slug":"progressreport(soclose!)"},{"title":"Our First Site Is Up","body_content":"Our First Site Is Up!\n\nThe very first site using the Sitesfor.Church system is live at [Bible Baptist Church.](http://biblebaptistmattoon.org)  It's using our **California** theme.  \n\nA few people requested a working demo - so here it is - going through the live site and showing how each section of content is managed using our Airtable system.  Check out the youtube video below:\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/K2xk81qpc5E\" frameborder=\"0\" allowfullscreen></iframe>\n\nIn the next few days, I should be able to show you another site running our **New England** Theme.  We are inching towards our launch on June 25.","featured_image":[{"id":"attifgx6YWEkbwOHy","url":"https://dl.airtable.com/G22G0PLSQaklYI31btiQ_Diem.jpg","filename":"Diem.jpg","size":1176739,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/zjZNOJo8Tv6k4iF5c3mq_small_Diem.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/MQMAmiqNSPm8bBkYm2iM_large_Diem.jpg","width":512,"height":512}}}],"date":"2016-06-17T12:29:13.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"our first site is up","remove spaces":"ourfirstsiteisup","remove questions":"ourfirstsiteisup","remove quotes":"ourfirstsiteisup","slug":"ourfirstsiteisup"},{"title":"Why We Love Static Sites","body_content":"**At Sitesfor.Church we are weird and proud of it.**  If you know any of us - you'd probably heartily agree, but that isn't what I was talking about.  Our websites are weird.  There are a lot of things that make us weird, but one of the main ones is that our sites are **static.**  \n\nTypical sites, like  those running Wordpress, run a program on a server and whenever you click on a link, that program runs, looks in a database, and finds a page.  This is called a *dynamic* site.\n\nIf you were to look on the server at Sitesfor.church you would find no programs.  All that is there is simple HTML and CSS files (and a little bit of javascript.)  This is called a *static* site. \n\nIn the early days of the internet - every website was static.  But over the last ten years dynamic sites took over leaving very few static sites behind.\n\nRecently however, some ingenious developers have created a new kind of program called a static site generator.  Static site generators allow web creators to have most of the benefits of a dynamic site with all of the benefits of a static site.  \n\nSo what are pros and cons to static sites, and why should you as a church care?  Let me start with the cons..\n\n# Cons\n\n## No instant updates.\n\nThe first con is one you may never notice.  When you add a post on Wordpress or some other dynamic system - that post is live immediately.  That's because all Wordpress has to do is put that content in a database.  On a static site - when new content is added many pages have to be completely torn down, rebuilt and then uploaded.  To add to this - on our system - we are pulling in content from an outside source (Airtable).  To do this, we run a script every hour that looks to see if their is new content on your site and if there is, rebuilds it.  Here is what that means for you: **When you add a post - you'll have to wait until the next hour before you can see it live on your site.**\n\nThis is, in our opinion, the biggest tradeoff of using static sites.\n\n\n## Certain features are very difficult to pull off.\n\nIn my opinion, the second con isn't as serious.  Certain features like blog comments and search are a little harder to implement on a static site.  To remedy this, we have to use external services (like Disqus for comments.) This in no way hinders the experience and most users would never even notice. You just have to set up Disqus.  (Which we'll help you with if you want comments.)\n\nMost church websites aren't doing comments anyways so this is probably not a big deal for most people.\n\n---\n\nSo, with these two cons why do we make static sites?  What are the...\n\n# Pros\n\n## Your site will be fast.\n\nThis is the main benefit and boy is it a benefit.  When you visit a static site - it flies onto your screen.  Users get almost zero perceptible lag when they transition between pages.  \n\nThis provides a much better experience for your users and it will help you get higher placement on Google and other search engines.\n\n## There is nothing to break.\n\nBecause the webhost is just hosting static files - there is nothing to break.  I can't tell you how many times I've had to fix issues with some content management system or had a site go down because some plugin didn't like a Wordpress update.  It will never happen on a static site.\n\nFurther, if there ever is a problem on our system, it won't effect your live site.  When their is a problem with the build process - you and your website guests never see it - we just have to fix the problem before your content is updated.\n\n\n## It's much easier to design and code.\n\nRight now we have four themes.  But we are planning on having many.  One of the things that makes this possible is it is very easy - almost trivial to plug a site design into our static generating system.  If you need some custom thing on your site - we can do it and probably do it quickly.\n\n## Hosting is inexpensive.\n\nBecause your site is just a bunch of static files, we can host it very, very inexpensively.  Just about any web host will work for a static site.  We can also host it on a network with a CDN, so it will be even faster.  Our low price point wouldn't be possible were it not for this benefit of static hosting.\n\n\n","featured_image":[{"id":"attiaFrybBYnOqFvz","url":"https://dl.airtable.com/PMedWKquSLvvRZ1HAig4_Static%20Website.jpg","filename":"Static Website.jpg","size":897344,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/nlu669FlQXW3scTiEjP7_small_Static%20Website.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/eCb1qdlOSEKn5JYHJvXR_large_Static%20Website.jpg","width":512,"height":512}}}],"date":"2016-06-16T20:45:51.000Z","categories":["general"],"author":"Ryan Hayden","lowercase":"why we love static sites","remove spaces":"whywelovestaticsites","remove questions":"whywelovestaticsites","remove quotes":"whywelovestaticsites","slug":"whywelovestaticsites"},{"title":"Final Countdown","body_content":"### Sitesfor.church will be launching Monday, June 25!\n\nDear prospective client,\nIt's been a wild couple of weeks, and we've cleared most of the technical hurdles that were keeping us from launching sitesfor.church.  I'm excited to say that we are getting close and have decided to set a deadline for June 25 and work like mad to get everything ready by then.\n\n## Here is what that means for you:\n\n### Documentation\n\nI've written a basic how-to guide for using the site.  I'm planning on writing much more and adding many more videos.  But this guide which I'm calling [Sitesfor.church 101](http://www.sitesfor.church/blog/sitesforchurch-101.html) should be a huge start.  It includes three videos explaining how to update the site.\n\n[Here is that link again.](http://www.sitesfor.church/blog/sitesforchurch-101.html)\n\n### Site-Reps\n\nWe now have four site-reps.  These guys (all of them preachers) will be paid to help you set up the site and to be your contact person should you need help. [Site reps are, far and away, the most exciting thing we are doing at sitesfor.church](http://www.sitesfor.church/blog/our-weird-business-plan-and-its-little-known-baptist-history.html) and I'm hoping this will be a big opportunity for them.  If you've already signed up to be one of our \"guinea pigs\" then, we'll let you know soon who your assigned site-rep is going to be.\n\n### Three Templates:\n\nWe are going to be launching with three custom templates for churches as well as a template for pastors or evangelists who want their own blog with sermons.  More church templates (from different designers) and missionary templates are in the works.\n\nCheck out the templates below:\n\n#### California Template\n\n![California Theme](https://dl.dropboxusercontent.com/u/47159282/california.png)\n\n#### New England Template\n\n![New England Theme](https://dl.dropboxusercontent.com/u/47159282/New%20England.jpg)\n\n#### Virginia Template \n\n![Virginia Theme](https://dl.dropboxusercontent.com/u/47159282/Virginia.jpg)\n\n#### Personal Template\n\n![Evangelist Theme](https://dl.dropboxusercontent.com/u/47159282/Evangelist.png)\n\n### Payment\n\nWhen we launch on June 25th, we will ask all of our prospective clients - even the ones we have been working with, to fill out the form on our signup page.  As a part of the signup options they'll be directed to PayPal where they can choose to pay for Sitesfor.church either monthly or annually.\n\n### We are going to try to keep you posted.  Thank you so much for your patience through all of this.","featured_image":[{"id":"attbunPAuGYxiGikE","url":"https://dl.airtable.com/bATBL6FQTmeqpUaXoDXg_countdown.jpg","filename":"countdown.jpg","size":263553,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/PxUeDSPRFmLj6lYXZBs1_small_countdown.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/4XlY9PztRY2SS8FIt8um_large_countdown.jpg","width":512,"height":512}}}],"date":"2016-06-15T06:01:46.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"final countdown","remove spaces":"finalcountdown","remove questions":"finalcountdown","remove quotes":"finalcountdown","slug":"finalcountdown"},{"title":"SitesforChurch 101","body_content":"# The Learning Curve: Website 101\n\nAt Sitesfor.church, we are dedicated to giving you the easiest to update church website you could possibly have.  But every website is going to have some learning curve.  We've learned over the years that often, in an attempt to make websites easier for nontechnical people, you can actually make things more complicated.\n\nWe think we've found the best mix of ease of use and necessary complexity.  Many of our clients who have used other more traditional website setups (like Wordpress) rave about how easy to use Sitesfor.church is.  The tradeoff is we ask you to learn three skills:\n* Airtable\n* Markdown\n* Image Creation\n\n## Airtable\n\nYour website data is managed through an Airtable database.  Airtable is an amazing program that allows you to manage your site with ease from any computer or smartphone.  \n\nAirtable is also built for sharing and collaboration, which means you can easily share access to all of your church databases with volunteers or you can share an individual database with a volunteer (like sharing just your sermons database with your sound volunteers.)\n\nIn Airtable, their are two main types of views that you can use.  The default view is called \"the grid view\" and it resembles a spreadsheet.  Simply click on an empty row and move from left to right the row and enter your information.  Alternatively, you can use a form view.  Airtable is better shown, than explained, so here is a video explaining how it all works:\n\nEvery field in Airtable should be self explanatory, but there are two conventions that you should be aware of that are the two other things we ask you to know...\n\n## Markdown\n\nIn Airtable, if the field is labeled \"content\" then you need to write **markdown** in that field.  So what is markdown?  Here's the long answer:\n\n> Markdown is a plain text syntax that computers can easily translate into styled HTML.\n\nIt may sound intimidating, but it's really not.  It's extremely easy to learn and even easier to write.  It's so easy that I write everything: my sermons, my letters, even our church bulletins - in markdown.  Markdown requires no special programs (although many markdown programs are out there).  You can type markdown content right into our content fields.\n\nAt it's most basic, Markdown looks like this:\n\n```markdown\n\n# Basic Stuff\n\n## Paragraphs, bold and italic \n\nParagraphs are just paragraphs.  They are separated by a space.\n\nThis is a new paragraph.  You make text **bold** by placing two asterisks around it.  You make text *italicized* by placing one set of asterisks around it.  *This whole sentence is italicized.* \n\n# Level one headings start with a single hash (or number symbol) and a space then text.  Like this.\n## This is a level two heading.\n### And level three.\n\n## Lists\n\nBulleted lists start with an asterisk and a space.  Like this:\n\n* Item one.\n* Item two.\n* Item three.\n\nNumbered lists are similar, but they start with a number, a period, then a space.  Like this:\n\n1. Item one\n2. Item two\n3. Item three\n\n\n# Advanced Stuff \n\n## Quotes\n\nQuotes can be inserted into your text by starting the line with a greater than sign and a space.  (I often use this for Bible verses) Like this:\n\n> For God so loved the world that he gave his only begotten son...(John 3:16a)\n\n## Links\n\nTo insert a link in a paragraph, simply place the link text in square brackets, immediately followed by the URL in parenthesis.  Like this [link text](http://URLhere.com).\n\n\n## Images\nImages are exactly like links, only they start with an exclamation point.  Like this:\n\n![description](http://linktoimagefile.jpg) \n\n```\n\n---\n\nThat's it, you now know markdown.  \n\nIf you are a visual learner, I've made a video explaining markdown and how it works with our sites here:\n\n<iframe src=\"https://player.vimeo.com/video/167274776\" width=\"640\" height=\"400\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe>\n<p><a href=\"https://vimeo.com/167274776\">A Five Minute Intro To Markdown</a> from <a href=\"https://vimeo.com/sitesforchurch\">Ryan Hayden</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n\nIf you really want a deep-dive into Markdown.  Wes Bos has created a fantastic free video course on Markdown that only takes about 30 minutes to complete.  You can find it here:\n\n[Mastering Markdown](http://masteringmarkdown.com/)\n\n## Special Website Images\n\nThe last piece of knowledge you are going to have to have is how to upload images.  Uploading images is pretty straightforward (just dragging or dropping images from your desktop to the airtable field will upload an image, or you can click the \"plus\" symbol in any attachment field to open an upload window) what you have to know is **how to format the images you upload**.  To keep things simple, all across the site we only use two types of images: featured images and thumbnails.\n\n### Featured Images\n\nAny time a field has the term \"featured image\" in it's name we are looking for a very specific kind of image.  We are looking for an image with a 16x9 aspect ratio.  Common 16x9 sizes include 1920x1080 (1080p) and 1280x720 (720p).  Images that are this size are the same sizes of standard television screens and are the most common format for slide images.\n\n### Thumbnails\n\nAny time you see the term thumbnail in a field's title what we are looking for is a square image.  At a minimum, we suggest an image that is at least 150x150 pixels.  Thumbnails are almost always pictures of people, and one easy way to get thumbnail images is to reuse twitter or Facebook avatars.\n\n### Helps\n\nIf you are most people, you don't have the technical skill to make good looking website images, so we have two things to help you:\n\n#### Defaults\n\nImages are an important part of any web design and when your site uses current images - it will really come alive.  But if you choose not to upload a custom featured image for a blog post, sermon series or event - we've got you covered. Each theme comes with appropriate default images that will display when you don't want to create your own.\n\n#### Canva.com\n\nWhen you do want to create your own, we highly suggest a service called [canva.com](http://canva.com).  Canva.com is a webapp that makes it super easy to create great looking images.  It's completely free to use unless you decide to use one of their stock images (which are very affordably priced.)  Simply open canva and choose the \"Presentation (16:9)\" template.  Customize it to your liking and then click the **download** button.\n\nYou can check out the video below, for in intro to canvas\n\n<iframe src=\"https://player.vimeo.com/video/160321640\" width=\"640\" height=\"360\" frameborder=\"0\" webkitallowfullscreen mozallowfullscreen allowfullscreen></iframe> <p><a href=\"https://vimeo.com/160321640\">Canva Integration</a> from <a href=\"https://vimeo.com/sitesforchurch\">Ryan Hayden</a> on <a href=\"https://vimeo.com\">Vimeo</a>.</p>\n\nWhenever possible, we include canva links in the description of the field.  In grid view, simply hover over the name of the field and you should see a canva.com link.  This will take you right to the right template. We also put these links in all of our forms. \n\n---\n\nThese are the best tools and easiest tools that we can find.  They are also useful for more than your website.  You can use markdown for all kinds of writing.  (We'll have blog posts about that), you can use airtable for many things in your church (we'll be releasing posts about that too) and you'll find that the featured images can be reused as slides (or vice versa) or for other promotions.\n\n\n\n\ns.","featured_image":[{"id":"att8MolBLIia9sigA","url":"https://dl.airtable.com/1LuXyLjNSuu49eSOb2G0_101.jpg","filename":"101.jpg","size":358171,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/D8ZVr1M7SwW5hpvBzbIP_small_101.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/8vQ3VvZRUKGskjfUgggi_large_101.jpg","width":512,"height":512}}}],"date":"2016-06-11T00:00:00.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"sitesforchurch 101","remove spaces":"sitesforchurch101","remove questions":"sitesforchurch101","remove quotes":"sitesforchurch101","slug":"sitesforchurch101"},{"title":"Airtable for a website?  Why you'll love it.","body_content":"Recently, at Sitesfor.church, we made the decision to use [Airtable](http://airtable.com) as the backbone of our church websites.  Airtable is an online database app (if Google Sheets and Microsoft Access had a baby it would look like Airtable.)  Using an app like this is a radical move - as far as we know no other web design company is doing - but we think you are going to love it.\n\n\nWhy?  We thought of ten reasons why you'll like it.\n\n## 1. You own your data.\n\nYour data will live on your Airtable account. You can do whatever you want with it. If in the future you want to use another web service or pay for a custom site - you can still use airtable to update your site.  \n\nYou can also add other databases and use them for whatever you want.  (We're working on a list of some great ways to use Airtable for churches.) \n\n## 2. It's ridiculously easy to use.\n\n![2](http://1u88jj3r4db2x4txp44yqfj1.wpengine.netdna-cdn.com/wp-content/uploads/2015/06/airtable-gif-demo.gif)\n\n\nOur old church website was run on a typical content management system with a sermon management plugin.  It worked, but wasn't any fun.  When I showed the Airtable Sermon database to the volunteer who records our sermons he stopped me midway and said \n\n> \"This is much, much, easier.\"\n\nAirtable is super easy to use.  I've used professional database applications that costs hundreds of dollars.  Airtable is better by orders of magnitude.  People just \"get it.\"  You will too.\n\n## 3. There are great mobile apps.\n\nAirtable's main app runs in your browser and you can access it anywhere.  It's a fantastic web app that gives feels like a native app.  \n\nBut Airtable also has a killer iOS app - which means you can take photos of an event with your phone and upload them to your church website with ease or record your sermon with your iPhone and upload it quickly.\n\n\n\n![1](https://s3-us-west-2.amazonaws.com/airtable-newsletter-assets/AirtableiPhoneScreenshots11-9-2015.png)\n\n\nAirtable has a Android app in beta.  So soon Android users will be able to update their sermons in the same way. \n\n## 4. Collaborate with anyone in real time.\n\nAirtable has great collaboration features.  You can easily add volunteers to your team and limit what they can and can't edit.  You can bring in people to work with just one database or all of them.\n\nYou can also send notifications to your team members with comments. You can watch people update content on another device in real time.  It's really awesome.\n\n## 5. Never worry about updates.\n\nI hate CMS updates.  Wordpress and it's cousins update constantly.  It takes time.  It's a hassle, and it's absolutely necessary.  (If you don't update your site you are likely to get hacked.)\n\nYou will never deal with application updates using our system.\n\n## 6. No plugins.  Just create a new database.\n\nA typical CMS has a built in blog.  That's it.  If you want more types of content, you have to add plugins.  Sometimes these plugins are expensive. Always these plugins are risky, because they potentally open up your website to hackers.  They slow your site down and they too need to be updated.\n\nMost plugins are just what developers call CRUD apps. That's not derogitory, it just stands for Create, Read, Update and Destroy.  Airtable can handle 3 of those functions (create, update, and destroy) and all the site needs to do is read the information from the database.  This means that if you can dream it and put it into a database, we can easily get it displayed on your site.\n\n## 7. There is less to break.\n\nContent Management Systems are a pain because they are prone to breaking. If you see a 404 error page - it's almost always the CMSs fault.  Because your site won't run on a CMS - there will be less to break.  Your site is just plain html.  Even when your when your site can't access airtable - it will be able to load static content.\n\n## 8. You don't have to trust cheap hosting servers.\n\nBecause your data is on Airtable - you don't have to trust hosting servers.  I've been doing this for over 10 years and several times a server has been gotten hacked and I've had to role back websites by several weeks.  (In most cases, the culprit was a wordpress plugin.)  Because your data is on Airtable and you we are just hosting the theme - if the host goes down you will lose nothing.\n\n## 9. You can roll back your data very easily.\n\nAirtable has a fantastic versioning system.  That means if you like the way your blog post sounded in a draft you wrote two hours ago - it's nothing to roll that back (and then forward again.)\n\n## 10. You can have it both ways.\n\nEventually, we will have a custom dashboard for your site and if you are more comfortable, you can use that.  But your site will always be based on Airtable, and you can keep using that.\n\n---\n\nThe one tradeoff of using Airtable is using markdown for long content.  We love markdown anyway and think this is really worth it.  Do you have your own thoughts about Airtable?  Let us know in the comments.","featured_image":[{"id":"attzRu84eAsweJTln","url":"https://dl.airtable.com/5nx29Fd6TKx6i6d7JIzA_airtable.png","filename":"airtable.png","size":38760,"type":"image/png","thumbnails":{"small":{"url":"https://dl.airtable.com/f6ocgJXORl2jSq4BmBrg_small_airtable.png","width":69,"height":36},"large":{"url":"https://dl.airtable.com/GJCWDWUoTWOpTAHZSqBq_large_airtable.png","width":512,"height":512}}}],"date":"2016-05-25T00:00:00.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"airtable for a website?  why you'll love it.","remove spaces":"airtableforawebsite?whyyou'llloveit.","remove questions":"airtableforawebsitewhyyou'llloveit.","remove quotes":"airtableforawebsitewhyyoullloveit.","slug":"airtableforawebsitewhyyoullloveit"},{"title":"Our weird business plan and it’s little known baptist history","body_content":"Sitesfor.church has two goals:\n\n1. Provide the best church website experience ever at a price even small churches can afford.\n2. Provide jobs for ministers-in-training that will help support them as well as build essential skills they can bring into the ministry.\n\nThe first goal has been our prime focus as we’ve worked on this, but as we launch (Hopefully at the beginning of May) we hope to transition our efforts to the second goal.  It’s our plan to hire Bible college and seminary students as well as bivocational pastors or other ministers who are needing support, train them, and to pay them on commission both for sales and to be liason’s for each church website account.\n\nPeople understand our first goal - but the second one often leaves people scratching their heads.  \n\nInterestingly, We're far from the first person to come up with something like this.  [James R. Graves](https://en.wikipedia.org/wiki/James_Robinson_Graves), one of the most influential people in American Baptist history, did something similar in the 1850s and it’s still around today.\n\n\n![graves2.jpg]({{site.baseurl}}/assets/graves.jpg)\n\n\nJames Graves started [Southwestern Publishing](http://www.southwestern.com/Southwestern-History.aspx?) company and came up with the novel idea of employing college students to sell books door to door.  Southwestern (Now known as “The Southwestern Company”) is still around today and is widely recognized as one of the best leadership training programs in the country.  Several state governors, fortune 500 CEOs, and even pastor/author Max Lucado (as well as more than 100,000 others) spent their summers working for Southwestern and credit it as a huge part of their life.\n\nIt’s our goal that Sitesfor.church will provide a similar benefit to those who work for us as site reps.  By working with us they will learn:\n* Sales skills.\n* People skills.\n* Technology and design skills.\nThey will also get to befriend and encourage pastors all over the country and learn about the ministry as they help each of these churches set up their ministry websites.  \n\nSo not only will they get a good paying job they can do while in college, they will learn new skills and gain invaluable experience that they can bring with them into the ministry.  We think it’s a win/win/win: churches benefit with a great church website, college students benefit by earning and learning and the cause of Christ benefits as both of these things bear fruit.","featured_image":[{"id":"attr9Oe9BW4fhNHR1","url":"https://dl.airtable.com/qrcGosH1T72VJkWNYaFq_weirdmodel.jpg","filename":"weirdmodel.jpg","size":200431,"type":"image/jpeg","thumbnails":{"small":{"url":"https://dl.airtable.com/cdrHXhKaRaKffRRrSfQO_small_weirdmodel.jpg","width":64,"height":36},"large":{"url":"https://dl.airtable.com/7DMykNQoQRCobzZpZI6r_large_weirdmodel.jpg","width":512,"height":512}}}],"date":"2016-03-31T00:00:00.000Z","categories":["general"],"author":"Ryan Hayden","published":true,"lowercase":"our weird business plan and it’s little known baptist history","remove spaces":"ourweirdbusinessplanandit’slittleknownbaptisthistory","remove questions":"ourweirdbusinessplanandit’slittleknownbaptisthistory","remove quotes":"ourweirdbusinessplanandit’slittleknownbaptisthistory","slug":"ourweirdbusinessplanandit’slittleknownbaptisthistory"}]